# Data Cleaning Using Python

In [27]:
# importing all the necessary libary
import pandas as pd
import numpy as np
import re
from sqlalchemy import create_engine
import warnings

In [28]:
warnings.filterwarnings("ignore") # to ignore unnecessary warnings while cleaning data

In [29]:
# loading all the datasets
sales_data = pd.read_csv(r"C:\Users\kumar\OneDrive\Desktop\All_in_one\sales_data_100k.csv")
cus_data = pd.read_csv(r"C:\Users\kumar\OneDrive\Desktop\All_in_one\customers_data_10k.csv")
pro_data = pd.read_csv(r"C:\Users\kumar\OneDrive\Desktop\All_in_one\products_data_1k.csv")

In [30]:
sales_data_copy = sales_data.copy()
cus_data_copy = cus_data.copy()
pro_data_copy = pro_data.copy()

In [31]:
# start with sales data
sales_data

,Order_ID,Customer_ID,Product_ID,Amount,Order_Date,Quantity,Discount,Payment_Method,Shipping_Cost,Status
0,10001,6614,819,$3010,8-2023-9,14,10%,Debit Card,$7,Pending
1,10002,5300,524,$1319,2023-10-8,19,15%,Crypto,$30,Returned
2,10003,4376,573,NaN,2023-2-10,5,5%,Crypto,$17,Pending
3,10004,970,1189,NaN,1-2023-24,1,15%,Debit Card,$45,Completed
4,10005,604,1095,$4337,2023-5-9,4,5%,Bank Transfer,NaN,Completed
...,...,...,...,...,...,...,...,...,...,...
99995,109996,6067,459,913$,2023-11-21,1,5%,PayPal,NaN,Cancelled
99996,109997,4636,813,1935$,2023/3/26,9,5%,Credit Card,$22,Completed
99997,109998,4351,344,2323,2023-3-6,14,5%,Credit Card,$28,Pending
99998,109999,4393,327,161$,2023-2-24,14,15%,PayPal,27,Completed
99999,110000,2254,518,2814,2023-3-11,6,20%,Crypto,6,Cancelled

In [32]:
sales_data.isna().sum()

Order_ID              0
Customer_ID           0
Product_ID            0
Amount            25051
Order_Date            0
Quantity              0
Discount          19901
Payment_Method        0
Shipping_Cost     33107
Status                0
dtype: int64

In [33]:
sales_data.columns = sales_data.columns.str.lower() # this code has change all the columns names into lower
sales_data.columns

Index(['order_id', 'customer_id', 'product_id', 'amount', 'order_date',
       'quantity', 'discount', 'payment_method', 'shipping_cost', 'status'],
      dtype='object')

In [34]:
sales_data.order_id.sample(20) # order_id required no cleaning

93600    103601
7630      17631
10809     20810
27820     37821
33367     43368
35275     45276
45372     55373
85265     95266
49818     59819
54427     64428
29057     39058
84683     94684
17561     27562
95351    105352
80825     90826
6238      16239
722       10723
60337     70338
39265     49266
7455      17456
Name: order_id, dtype: int64

In [35]:
sales_data.order_id.nunique() # all the order_id are unique and primary key contendar

100000

In [36]:
sales_data.customer_id.sample(20)

76985    6114
63886    7261
86839    9643
36940     792
98836     640
12669     664
41121    9492
94852    4058
85027    5349
49649    6545
15276    3284
88031    2836
8059     1867
39431    3522
22498    8599
33188    2520
34746    8174
9074     2286
82157    7617
68545    8551
Name: customer_id, dtype: int64

In [37]:
sales_data.product_id.value_counts()

product_id
848     134
913     131
884     130
1160    129
319     127
       ...
774      75
226      75
1078     73
373      73
1006     70
Name: count, Length: 1000, dtype: int64

In [38]:
sales_data[sales_data.amount.isna()] # when we will clean product_data then we will get back to this

,order_id,customer_id,product_id,amount,order_date,quantity,discount,payment_method,shipping_cost,status
2,10003,4376,573,NaN,2023-2-10,5,5%,Crypto,$17,Pending
3,10004,970,1189,NaN,1-2023-24,1,15%,Debit Card,$45,Completed
5,10006,1875,594,NaN,5-2023-1,13,10%,Debit Card,46,Cancelled
10,10011,4378,449,NaN,2023-4-4,18,NaN,Bank Transfer,$40,Completed
12,10013,4600,903,NaN,2023-10-12,13,10%,Bank Transfer,40,Pending
...,...,...,...,...,...,...,...,...,...,...
99979,109980,1495,1109,NaN,2023-6-22,3,15%,Credit Card,$11,Pending
99980,109981,2654,696,NaN,2023-7-26,2,NaN,Credit Card,NaN,Completed
99985,109986,9218,362,NaN,2023/7/6,3,20%,PayPal,$35,Pending
99990,109991,170,496,NaN,12-2023-7,10,20%,Crypto,NaN,Returned
99993,109994,1144,321,NaN,2-2023-21,17,5%,Bank Transfer,32,Pending

In [39]:
sales_data["order_date"] = sales_data.order_date.str.replace("/","-")
sales_data["order_date"].sample(30)

10673     2023-7-12
74374      2023-8-3
23641     2023-5-26
86184     2023-8-10
65051      2023-7-6
27985      7-2023-2
75119      8-2023-8
43587     2023-7-12
29157     2023-9-13
59440      3-2023-2
13148    2023-12-16
19406     2023-1-18
64326     7-2023-23
95821     9-2023-17
55838      2023-4-5
84305     7-2023-24
16317     2023-12-8
3968       2023-1-8
75587     9-2023-20
11344     2023-4-14
9141       2023-9-4
54363     2023-12-3
95837      5-2023-2
35419    2023-12-19
49920     2023-8-19
44708     2023-7-23
11859     10-2023-6
25288     9-2023-17
62006     2023-2-21
96224     11-2023-7
Name: order_date, dtype: object

In [40]:
# sales_data["order_date"].dt('mm-yyyy-dd')
# sales_data["order_date"] = pd.to_datetime(sales_data["order_date"], format="mixed", errors="coerce")
sales_data["order_date"].isna().sum()

np.int64(0)

In [41]:
def convert_dates(date_str):
    try:
        # Check if the format is yyyy-mm-dd (year first)
        if "-" in date_str and len(date_str.split("-")[0]) == 4:
            return pd.to_datetime(date_str, format=r"%Y-%m-%d").strftime(r"%d/%m/%Y")
        # Check if the format is mm-yyyy-dd (month first)
        elif "-" in date_str and len(date_str.split("-")[1]) == 4:
            return pd.to_datetime(date_str, format=r"%m-%Y-%d").strftime(r"%d/%m/%Y")
    except Exception:
        return None  # Return None for unrecognized formats

# Apply the conversion function to the date column
sales_data["order_date"] = sales_data["order_date"].apply(convert_dates)

In [42]:
sales_data.discount.fillna("0",inplace=True)
sales_data["discount"] = sales_data["discount"].str.replace("%","").astype(int)

In [43]:
sales_data.rename(columns={"discount":"discount_in_%"},inplace=True)

In [47]:
sales_data.shipping_cost.fillna("0",inplace=True)

In [46]:
sales_data.shipping_cost

0         $7
1        $30
2        $17
3        $45
4        NaN
        ...
99995    NaN
99996    $22
99997    $28
99998     27
99999      6
Name: shipping_cost, Length: 100000, dtype: object

In [ ]:
sales_data["shipping_cost"]=sales_data["shipping_cost"].str.replace("$","").astype(float).astype(int)

In [79]:
sales_data["shipping_cost"].sample(20)

19699     6
20802     0
56583     0
34461    12
31205     0
40424     0
2941      0
34887    29
86890    30
93616    44
41893    33
73889    30
7319      0
28077    46
16903     0
94902     0
91451     0
83697    39
47268    34
11758    36
Name: shipping_cost, dtype: int64

In [80]:
sales_data

,order_id,customer_id,product_id,amount,order_date,quantity,discount_in_%,payment_method,shipping_cost,status
0,10001,6614,819,$3010,09/08/2023,14,10,Debit Card,7,Pending
1,10002,5300,524,$1319,08/10/2023,19,15,Crypto,30,Returned
2,10003,4376,573,NaN,10/02/2023,5,5,Crypto,17,Pending
3,10004,970,1189,NaN,24/01/2023,1,15,Debit Card,45,Completed
4,10005,604,1095,$4337,09/05/2023,4,5,Bank Transfer,0,Completed
...,...,...,...,...,...,...,...,...,...,...
99995,109996,6067,459,913$,21/11/2023,1,5,PayPal,0,Cancelled
99996,109997,4636,813,1935$,26/03/2023,9,5,Credit Card,22,Completed
99997,109998,4351,344,2323,06/03/2023,14,5,Credit Card,28,Pending
99998,109999,4393,327,161$,24/02/2023,14,15,PayPal,27,Completed
99999,110000,2254,518,2814,11/03/2023,6,20,Crypto,6,Cancelled

In [81]:
sales_data.isna().sum()

order_id              0
customer_id           0
product_id            0
amount            25051
order_date            0
quantity              0
discount_in_%         0
payment_method        0
shipping_cost         0
status                0
dtype: int64

In [82]:
sales_data.shipping_cost.value_counts()

shipping_cost
0     33107
49     1518
18     1517
21     1511
39     1504
48     1496
28     1495
32     1493
12     1493
9      1491
40     1486
29     1484
27     1481
7      1473
25     1464
19     1464
46     1464
5      1460
24     1459
16     1459
22     1459
11     1457
15     1457
13     1455
41     1455
20     1452
6      1452
30     1452
36     1451
42     1450
23     1450
44     1445
10     1445
14     1443
50     1438
35     1437
26     1433
8      1424
47     1422
33     1414
34     1413
31     1409
17     1408
45     1394
37     1392
38     1387
43     1387
Name: count, dtype: int64

In [83]:
DATABASE_URI = "mysql+pymysql://root:Ketan@localhost:3306/sales_analysis_project"
engine = create_engine(DATABASE_URI)
sales_data.to_sql("sales_data",con = engine,index = False,if_exists='replace')

100000

In [52]:
# cleaning second dataset
cus_data

,Customer_ID,Customer_Name,Email,Phone,Address
0,1,Customer_1,customer1@example.com,NaN,Chicago
1,2,Customer_2,NaN,123-456-7832,New York
2,3,Customer_3,customer3@example.com,(555) 234-5687,Miami
3,4,Customer_4,customer4@example.com,123-456-7874,Houston
4,5,Customer_5,customer5@test.org,(555) 234-5697,Los Angeles
...,...,...,...,...,...
9995,9996,Customer_9996,customer9996@example.com,NaN,New York
9996,9997,Customer_9997,NaN,123-456-7820,New York
9997,9998,Customer_9998,NaN,9876543218,Chicago
9998,9999,Customer_9999,customer9999@test.org,(555) 234-5645,Seattle
9999,10000,Customer_10000,NaN,9876543285,Chicago

In [53]:
cus_data.columns

Index(['Customer_ID', 'Customer_Name', 'Email', 'Phone', 'Address'], dtype='object')

In [54]:
# changing all the columns names into lower
cus_data.columns = cus_data.columns.str.lower()
cus_data.columns

Index(['customer_id', 'customer_name', 'email', 'phone', 'address'], dtype='object')

In [55]:
# checking which columns has null values
cus_data.isna().sum()

customer_id         0
customer_name       0
email            3309
phone            2448
address             0
dtype: int64

In [56]:
cus_data.loc[4980:5020]

,customer_id,customer_name,email,phone,address
4980,4981,Customer_4981,customer4981@test.org,NaN,Los Angeles
4981,4982,Customer_4982,customer4982@test.org,(555) 234-5612,Los Angeles
4982,4983,Customer_4983,NaN,(555) 234-5678,Chicago
4983,4984,Customer_4984,customer4984@test.org,9876543283,New York
4984,4985,Customer_4985,customer4985@example.com,123-456-7884,Miami
4985,4986,Customer_4986,customer4986@example.com,9876543241,Miami
4986,4987,Customer_4987,customer4987@test.org,NaN,Seattle
4987,4988,Customer_4988,NaN,(555) 234-5642,Seattle
4988,4989,Customer_4989,customer4989@example.com,NaN,Houston
4989,4990,Customer_4990,NaN,123-456-7888,Houston
4990,4991,Customer_4991,customer4991@example.com,(555) 234-5632,Houston
4991,4992,Customer_4992,NaN,9876543255,Seattle
4992,4993,Customer_4993,customer4993@test.org,NaN,New York
4993,4994,Customer_4994,customer4994@test.org,NaN,New York
4994,4995,Customer_4995,NaN,(555) 234-5692,Miami
4995,4996,Customer_4996,NaN,NaN,Miami
4996,4997,Customer_4997,NaN,NaN,Chicago
4997,4998,Customer_4998,customer4998@example.com,123-456-7814,Los Angeles
4998,4999,Customer_4999,customer4999@example.com,123-456-7857,Chicago
4999,5000,Customer_5000,customer5000@example.com,9876543261,New York
5000,5001,Customer_5001,customer5001@example.com,(555) 234-5671,Seattle
5001,5002,Customer_5002,NaN,NaN,New York
5002,5003,Customer_5003,NaN,123-456-7820,Los Angeles
5003,5004,Customer_5004,customer5004@example.com,123-456-7884,Houston
5004,5005,Customer_5005,customer5005@test.org,(555) 234-5661,Miami
5005,5006,Customer_5006,customer5006@example.com,(555) 234-5650,Chicago
5006,5007,Customer_5007,customer5007@test.org,9876543218,Seattle
5007,5008,Customer_5008,customer5008@test.org,123-456-7857,Houston
5008,5009,Customer_5009,NaN,(555) 234-5659,New York
5009,5010,Customer_5010,customer5010@example.com,(555) 234-5657,Los Angeles
5010,5011,Customer_5011,customer5011@test.org,NaN,Los Angeles
5011,5012,Customer_5012,customer5012@test.org,NaN,Houston
5012,5013,Customer_5013,customer5013@test.org,(555) 234-5676,Seattle
5013,5014,Customer_5014,customer5014@example.com,123-456-7863,Chicago
5014,5015,Customer_5015,customer5015@test.org,NaN,Seattle
5015,5016,Customer_5016,customer5016@test.org,123-456-7843,New York
5016,5017,Customer_5017,customer5017@example.com,NaN,Los Angeles
5017,5018,Customer_5018,NaN,(555) 234-5621,Seattle
5018,5019,Customer_5019,customer5019@test.org,(555) 234-5653,Chicago
5019,5020,Customer_5020,NaN,9876543296,Houston
5020,5021,Customer_5021,customer5021@example.com,(555) 234-5662,New York

In [57]:
# checking email column all null values
cus_data[cus_data["email"].isna()]

      customer_id   customer_name email           phone      address
1               2      Customer_2   NaN    123-456-7832     New York
7               8      Customer_8   NaN      9876543279     New York
8               9      Customer_9   NaN             NaN  Los Angeles
9              10     Customer_10   NaN             NaN     New York
13             14     Customer_14   NaN      9876543221      Seattle
...           ...             ...   ...             ...          ...
9992         9993   Customer_9993   NaN    123-456-7894     New York
9993         9994   Customer_9994   NaN  (555) 234-5622      Houston
9996         9997   Customer_9997   NaN    123-456-7820     New York
9997         9998   Customer_9998   NaN      9876543218      Chicago
9999        10000  Customer_10000   NaN      9876543285      Chicago

[3309 rows x 5 columns]

In [58]:
cus_data['phone'].sample(20)

2623      123-456-7896
2607      123-456-7839
3826        9876543264
5204        9876543266
2232        9876543284
6436      123-456-7882
4302               NaN
5701      123-456-7882
3999               NaN
9897      123-456-7836
3373               NaN
1719               NaN
1976               NaN
653       123-456-7884
3435    (555) 234-5643
3337    (555) 234-5656
3825               NaN
4898               NaN
9830               NaN
5095        9876543240
Name: phone, dtype: object

In [59]:
#changing phone number in US format

def format_phone_number(number):
    if pd.isna(number) or number == 'Nan':  # Handle NaN or string 'Nan'
        return None
    
    # Extract only digits
    digits = ''.join([char for char in number if char.isdigit()])
    
    # Ensure it's a 10-digit number
    if len(digits) == 10:
        return f"({digits[:3]}) {digits[3:6]}-{digits[6:]}"
    
cus_data['phone'] = cus_data['phone'].apply(format_phone_number)

In [60]:
cus_data['phone'].sample(20)

3170              None
6820              None
1176    (555) 234-5661
3368    (555) 234-5667
335               None
8737              None
1703              None
9139    (987) 654-3264
2188    (123) 456-7878
793     (555) 234-5698
9425              None
6114    (123) 456-7894
111     (123) 456-7880
6901    (123) 456-7868
9576              None
7179    (123) 456-7889
617               None
9067    (555) 234-5655
8418    (123) 456-7828
1367    (987) 654-3241
Name: phone, dtype: object

In [61]:
# now checking how many null we have phone column whether we can remove them or not
cus_data['phone'].isna().sum()

np.int64(2448)

In [84]:

cus_data.to_sql("cus_data",con = engine,index = False,if_exists='replace')

10000

In [63]:
cus_data

,customer_id,customer_name,email,phone,address
0,1,Customer_1,customer1@example.com,None,Chicago
1,2,Customer_2,NaN,(123) 456-7832,New York
2,3,Customer_3,customer3@example.com,(555) 234-5687,Miami
3,4,Customer_4,customer4@example.com,(123) 456-7874,Houston
4,5,Customer_5,customer5@test.org,(555) 234-5697,Los Angeles
...,...,...,...,...,...
9995,9996,Customer_9996,customer9996@example.com,None,New York
9996,9997,Customer_9997,NaN,(123) 456-7820,New York
9997,9998,Customer_9998,NaN,(987) 654-3218,Chicago
9998,9999,Customer_9999,customer9999@test.org,(555) 234-5645,Seattle
9999,10000,Customer_10000,NaN,(987) 654-3285,Chicago

In [64]:
# now working on product dataset
pro_data

     Product_ID  Product_Name     Category  Price Stock_Available    Supplier
0           201   Product_201     Clothing   1466             NaN  Supplier_A
1           202   Product_202       Office   4102             NaN  Supplier_A
2           203   Product_203     Clothing   $530              No  Supplier_A
3           204   Product_204  Electronics   $943              No  Supplier_A
4           205   Product_205       Office   4050    Out of Stock  Supplier_B
..          ...           ...          ...    ...             ...         ...
995        1196  Product_1196  Electronics   $851              No  Supplier_B
996        1197  Product_1197  Accessories  1893$              No  Supplier_C
997        1198  Product_1198       Office  1433$             Yes  Supplier_B
998        1199  Product_1199       Office   1469              No  Supplier_C
999        1200  Product_1200  Electronics   3624       Available  Supplier_B

[1000 rows x 6 columns]

In [65]:
# all columns in dataset
pro_data.columns

Index(['Product_ID', 'Product_Name', 'Category', 'Price', 'Stock_Available',
       'Supplier'],
      dtype='object')

In [66]:
# changing all columns in lower order
pro_data.columns = pro_data.columns.str.lower()
pro_data.columns

Index(['product_id', 'product_name', 'category', 'price', 'stock_available',
       'supplier'],
      dtype='object')

In [67]:
# checking for null values
pro_data.isna().sum()

product_id           0
product_name         0
category             0
price                0
stock_available    168
supplier             0
dtype: int64

In [68]:
# checking samples whether changes required or not in any column
pro_data.sample(20)

     product_id  product_name     category  price stock_available    supplier
309         510   Product_510     Clothing  $3266    Out of Stock  Supplier_C
298         499   Product_499  Accessories   3734       Available  Supplier_B
952        1153  Product_1153  Accessories  4844$              No  Supplier_C
638         839   Product_839  Electronics   2432    Out of Stock  Supplier_B
955        1156  Product_1156       Office  $1665       Available  Supplier_D
848        1049  Product_1049     Clothing  $3071              No  Supplier_B
910        1111  Product_1111     Clothing   702$       Available  Supplier_D
746         947   Product_947  Electronics    738       Available  Supplier_B
899        1100  Product_1100     Clothing   3113       Available  Supplier_B
46          247   Product_247     Clothing  1386$             yes  Supplier_D
207         408   Product_408       Office  1314$       Available  Supplier_B
861        1062  Product_1062  Accessories   $137       Available  Supplier_B
983        1184  Product_1184  Electronics   980$              No  Supplier_C
511         712   Product_712  Accessories  2654$             Yes  Supplier_D
977        1178  Product_1178       Office  1097$    Out of Stock  Supplier_B
43          244   Product_244  Accessories  $3248       Available  Supplier_D
477         678   Product_678    Furniture  $4693              No  Supplier_C
810        1011  Product_1011       Office    646             yes  Supplier_D
741         942   Product_942     Clothing  $2937              No  Supplier_B
541         742   Product_742       Office  $3346    Out of Stock  Supplier_C

In [69]:
# now after looking at the sample we need to do required changes in price and stock_available column

In [70]:
pro_data["price"].sample(20)
# changing price column in one format
pro_data['price'] = pro_data['price'].str.replace('$', '').astype(int)

In [71]:
pro_data

     product_id  product_name     category  price stock_available    supplier
0           201   Product_201     Clothing   1466             NaN  Supplier_A
1           202   Product_202       Office   4102             NaN  Supplier_A
2           203   Product_203     Clothing    530              No  Supplier_A
3           204   Product_204  Electronics    943              No  Supplier_A
4           205   Product_205       Office   4050    Out of Stock  Supplier_B
..          ...           ...          ...    ...             ...         ...
995        1196  Product_1196  Electronics    851              No  Supplier_B
996        1197  Product_1197  Accessories   1893              No  Supplier_C
997        1198  Product_1198       Office   1433             Yes  Supplier_B
998        1199  Product_1199       Office   1469              No  Supplier_C
999        1200  Product_1200  Electronics   3624       Available  Supplier_B

[1000 rows x 6 columns]

In [72]:
pro_data['price'].dtype

dtype('int64')

In [73]:
# changing price column name
pro_data.rename(columns={"price":"price_in_$"},inplace=True)

In [74]:
pro_data['Stock_Available']=pro_data['Stock_Available'].str.lower().replace('yes',"Available")

KeyError: 'Stock_Available'

In [ ]:
pro_data

,product_id,product_name,category,price_in_$,stock_available,supplier
0,201,Product_201,Clothing,1466,NaN,Supplier_A
1,202,Product_202,Office,4102,NaN,Supplier_A
2,203,Product_203,Clothing,530,No,Supplier_A
3,204,Product_204,Electronics,943,No,Supplier_A
4,205,Product_205,Office,4050,Out of Stock,Supplier_B
...,...,...,...,...,...,...
995,1196,Product_1196,Electronics,851,No,Supplier_B
996,1197,Product_1197,Accessories,1893,No,Supplier_C
997,1198,Product_1198,Office,1433,Yes,Supplier_B
998,1199,Product_1199,Office,1469,No,Supplier_C
999,1200,Product_1200,Electronics,3624,Available,Supplier_B

In [85]:
#required changes in stock_available columns
pro_data.loc[(pro_data['stock_available']== "yes") | (pro_data['stock_available']== "Yes"),"stock_available"] = 'Available'
pro_data.loc[(pro_data['stock_available']== "no") | (pro_data['stock_available']== "No"),"stock_available"] = 'Out of Stock'

In [ ]:
pro_data['stock_available'].value_counts()

stock_available
Available       506
Out of Stock    326
Name: count, dtype: int64

In [ ]:
pro_data.isna().sum() # still have null values in stock_available column

product_id           0
product_name         0
category             0
price_in_$           0
stock_available    168
supplier             0
dtype: int64

In [ ]:
pro_data.dtypes

product_id          int64
product_name       object
category           object
price_in_$          int64
stock_available    object
supplier           object
dtype: object

In [ ]:
pro_data.sample(30)

     Product_ID  Product_Name     Category  Price Stock_Available    Supplier
941        1142  Product_1142       Office    634       Available  Supplier_B
122         323   Product_323       Office   3205    out of stock  Supplier_A
700         901   Product_901  Electronics  $4102              no  Supplier_A
172         373   Product_373       Office  4462$    out of stock  Supplier_A
784         985   Product_985    Furniture   2139       available  Supplier_B
220         421   Product_421  Accessories   2943    out of stock  Supplier_C
472         673   Product_673  Electronics   289$             NaN  Supplier_D
105         306   Product_306     Clothing  4106$       Available  Supplier_D
144         345   Product_345  Electronics   119$       Available  Supplier_B
292         493   Product_493       Office  $1267    out of stock  Supplier_B
514         715   Product_715       Office   3161       Available  Supplier_B
819        1020  Product_1020       Office   635$              no  Supplier_C
62          263   Product_263    Furniture    612       Available  Supplier_C
2           203   Product_203     Clothing   $530              no  Supplier_A
717         918   Product_918  Accessories  $2340    out of stock  Supplier_D
528         729   Product_729  Accessories   4027              no  Supplier_D
578         779   Product_779  Accessories  2892$              no  Supplier_A
445         646   Product_646       Office   1414              no  Supplier_D
206         407   Product_407     Clothing  2084$       Available  Supplier_A
714         915   Product_915     Clothing  $1774       Available  Supplier_B
768         969   Product_969  Accessories   2656       available  Supplier_A
705         906   Product_906     Clothing  $3739       Available  Supplier_C
246         447   Product_447  Electronics   $721    out of stock  Supplier_C
893        1094  Product_1094       Office  $3547       Available  Supplier_B
324         525   Product_525  Accessories    772              no  Supplier_B
519         720   Product_720       Office   1196             NaN  Supplier_B
898        1099  Product_1099       Office   960$       Available  Supplier_C
383         584   Product_584  Accessories  $2202             NaN  Supplier_B
208         409   Product_409       Office  3311$              no  Supplier_C
881        1082  Product_1082  Accessories   $673       available  Supplier_B

In [86]:
pro_data.to_sql("pro_data",con = engine,index = False,if_exists='replace')

1000